# База знаний по Object Pascal
Object pascal &mdash; объектно-ориентированный язык программирования высокого уровня.

Этот файл можно использовать как справочник, конспект или памятку.

## Языки программирования

**Низкоуровневый язык программирования** &mdash; это  язык программирования, близкий к программированию непосредственно в машинных кодах процессора. Для обозначения машинных команд обычно применяется мнемоническое обозначение. Мнемоническое обозначение &mdash; это команды не в виде двоичного кода, а в виде сокращений слов (обычно английских).

Общеизвестный пример низкоуровневого языка — язык ассемблера. Также к языкам низкого уровня условно можно причислить CIL, применяемый в платформе Microsoft .NET.

Пример:

```
                                    Перевод чисел в двоичную форму (в виде строки)
NmbrToBi$ proc ;POW36
;Входные данные:  AX - смещение строки, BX - число, которое необходимо преобразовать
;Выходные данные: Строка ASCIIZ. Регистры не сохраняются.
  mov DI,AX     ;смещение строки
  mov DX,8000h  ;проверочное слово, 1 в позиции 15
  mov CX,16     ;обрабатываем 16 бит
  NumberTo_B0:
    mov AL,48   ;символ '0'
    test BX,DX  ;бит равен 1?
    jz NumberTo_B
      inc AL    ;символ '1'
    NumberTo_B:
    stosb       ;записываем в строку '1' или '0'
    shr DX,1    ;сдвигаем тестовый бит вправо
  loop NumberTo_B0
  mov [DI],DL ;завершаем строку 0
ret
NmbrToBi$ endp
```

   * {?} Что такое язык программирования **высокого уровня** &mdash; ?;

## Основы Object Pascal

  Переменная &mdash; это поименованная область памяти, адрес которой можно использовать для осуществления доступа к данным и изменять значение в ходе выполнения программы. Переменные нужны для хранение в них информации и использование её при написании программы.
  
  **«Магическое число»** в программировании имеет три значения:
   - Сигнатура данных
     
   - Выделенные уникальные значения, которые не должны совпадать с другими значениями (например, UUID)
  
   - Плохая практика программирования.
 
      
      * {?} Что такое "магические числа" &mdash; ?;
      * {?} Как объявить переменную в object pascal &mdash; ?;
  * {?} Что такое **глобальная переменная** &mdash; ?;
      * {?} Зачем нужны глобальные переменные &mdash; ?;
      * {?} Как объявить глобальную переменную в object pascal &mdash; ?;
  * {?} Что такое **константа** &mdash; ?;
      * {?} Зачем нужны константы &mdash; ?;
      * {?} Как объявить константу в object pascal &mdash; ?;
      
  **Процедура** &mdash; это часть компьютерной программы, содержащая описание определённого набора действий. Она может быть многократно вызвана из любой части программы. В отличии от функции, процедура не имеет возвращаемого значения.
  
  Пример:
  ```
  program SubProgExample;
    // Описание подпрограммы subprog
    procedure subprog; // Заголовок, включающий имя подпрограммы
    begin // начало тела подпрограммы
      WriteLn('Bye');
    end; // конец тела подпрограммы
  begin
    WriteLn('Hello');
    subprog; // 1-й вызов
    subprog; // 2-й вызов
    subprog; // 3-й вызов
  end.
  ```
   
  **Функция** &mdash; это фрагмент программного кода (подпрограмма), к которому можно обратиться из другого места программы. 
  
  При помощи функций *упрощается текст программы* (текст становится более модульным, поэтому его легче понять), *уменьшается дублирование текста в программе* (полезно в случае повторяющихся блоках инструкций), *упрощаются отладка и тестирование* (при условии , что на каждую подзадачу есть своя функция , т.к. в таком случае их (функии) можно проверять по отдельности), *ускоряется разработка программы* (если идёт работа над несколькими программами где требуются решить одни и теже задачи), *упрощается коллективная работа* ( если функции решают конкретную задачу и сама программа состоит из мало связанных между собой функций).
   
   Пример:
   ```
   fuction FSum(x1, x2: real; a: integer):real
   begin
    Result := a*(x1+x2);
   end.
   ```
   
   ***Аргумент функции*** &mdash; это значение (число, указатель и т. д.), передаваемое функции, а также название переменной в тексте программы, выступающее в качестве идентификатора этого значения. Также может называться "параметром" функции.
  
   ***Значение функции*** &mdash; это значение аргумента функции. Задаётся при помощи "Result" или названия функции.
  
 
   * {?} Как присвоить значение функции в object pascal &mdash; ?;
      * {?} Что такое объявление функции и как объявить функцию object pascal &mdash; ?;
      * {?} Что такое реализация функции и как создать реализацию функции object pascal &mdash; ?;
      * {?} Как объявить переменную функции в object pascal &mdash; ?;
